cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'bash-completion'  # basic bash completion
brew 'bat'				# better cat
brew 'coreutils'        # GNU tools like `shuf` from Linux
brew 'cowsay'           # more than just cows
brew 'direnv'           # loads .env into shell vars
brew 'exa'              # better `ls` in Rust
brew 'fd'               # better `find`
brew 'figlet'           # makes ascii words
brew 'fish'             # fish shell
brew 'fortune'          # so many sayings
brew 'gh'               # github's own `hub`
brew 'gist'             # make gists from the command line
brew 'git'              # an independent git
brew 'glow'             # print md in cli
brew 'gnupg'            # gpg for the nu cru
brew 'go'               # go lang
brew 'gping'            # graph ping
brew 'grc'              # colorize log files and cli output
brew 'hub'              # do we need this and `gh`?
brew 'jq'               # json query tool
brew 'lolcat'           # comes with Kamadhenu too
brew 'lsd'              # better `ls`, maybe use `exa` tho
brew 'micro'            # better `nano`
brew 'mosh'             # ssh fudger
brew 'neovim'           # vim took the red pill
brew 'node'             # callback jungle
brew 'nvm'              # node version manager
brew 'openjdk'          # installs java runtime too
brew 'openssl'          # https is in another castle
brew 'pastel'           # cli color tool
brew 'postgresql'       # SQL for after your GRE
brew 'python'           # the snake that ate montgomery
brew 'rbenv'            # how we got these gems
brew 'redis'            # upvotes and silver
brew 'ripgrep'          # better `grep
brew 'scc'              # sloc cloc and code aka succinct code counter
brew 'sd'               # better `sed` replace
brew 'shpotify'         # spotify meets shell
brew 'sk'               # skim - fuzzy grep
brew 'spark'            # a tiny graph on the command line
brew 'starship'         # cross-shell prompt in rust
brew 'the_silver_searcher' # ag fast ack searcher
brew 'tldr'             # better `man`
brew 'tmux'             # terminal multiplexer
brew 'trash'            # mac-friendly rm-ing
brew 'tree'             # what apples fall from
brew 'wego'             # cli weather
brew 'wget'             # straighter curl
brew 'wtfutil'          # rarely used but key info
brew 'yarn'             # npm for hobbyists
brew 'zenith'           # better `vtop` `gtop` `htop`

# cask 'dashlane'
cask 'google-chrome'
cask 'firefox'
cask 'handbrake'     # video (en/de)coder
cask 'iterm2'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'transmission'  # torrentz?
cask 'visual-studio-code'
cask 'vlc'
