cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# brew 'ack'           # quick file search
# brew 'ruby-build'
# brew 'spaceman-diff' # image differ
# brew 'youtube-dl'    # download YouTube videos
brew 'bash-completion'
brew 'coreutils'     # GNU tools like `shuf` from Linux
brew 'cowsay'
brew 'direnv' # loads .env into shell vars
brew 'exa' # better `ls` in Rust
brew 'fd' # better `find`
brew 'figlet'
brew 'fish'          # fish shell
brew 'fortune'
brew 'gh' # github's own `hub`
brew 'gist'          # make gists from the command line
brew 'git'
brew 'glow' # print md in cli
brew 'gnupg' # gpg
brew 'go'
brew 'gping' # graph ping
brew 'grc'           # colorize log files and cli output
brew 'hub' # do we need this and `gh`?
brew 'jq'
brew 'lolcat' # comes with Kamadhenu too
brew 'lsd' # better `ls`, maybe use `exa` tho
brew 'micro' # better `nano`
brew 'mosh'
brew 'neovim'
brew 'node'
brew 'nvm' # node version manager
brew 'openjdk' # installs java runtime too
brew 'openssl'
brew 'pastel' # cli color tool
brew 'postgresql'
brew 'python'
brew 'rbenv'
brew 'redis'
brew 'ripgrep' # better `grep
brew 'scc' # sloc cloc and code aka succinct code counter
brew 'sd' # better `sed` replace
brew 'shpotify'      # spotify meets shell
brew 'sk' # skim - fuzzy grep
brew 'spark'
brew 'starship' # cross-shell prompt in rust
brew 'tldr' # better `man`
brew 'tmux'          # terminal multiplexer
brew 'trash'
brew 'tree'
brew 'wego' # cli weather
brew 'wget'
brew 'wtfutil' # rarely used but key info
brew 'yarn'
brew 'z' # jump around
brew 'zenith' # better `vtop` `gtop` `htop`

# cask '1password'
# cask 'atom'
# cask 'google-chrome'
# cask 'handbrake'     # video (en/de)coder
# cask 'iterm2'
# cask 'slack'
# cask 'spotify'
# cask 'transmission'  # torrentz?
# cask 'visual-studio-code'
# cask 'vlc'
