cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'           # quick file search
brew 'bash-completion'
brew 'coreutils'     # GNU tools like `shuf` from Linux
brew 'fish'          # fish shell
brew 'gist'          # make gists from the command line
brew 'git'
brew 'go'
brew 'grc'           # colorize log files and cli output
# brew 'jp2a'
# brew 'jq'
# brew 'libgit2'
brew 'mosh'
brew 'openssl'
brew 'neovim'
brew 'node'
# brew 'postgresql'
brew 'python'
# brew 'ruby-build'
# brew 'rbenv'
brew 'shpotify'      # spotify meets shell
# brew 'spaceman-diff' # image differ
brew 'tmux'          # terminal multiplexer
brew 'tree'
# brew 'unrar'
brew 'wget'
brew 'yarn'
# brew 'youtube-dl'    # download YouTube videos

# cask '1password'
# cask 'atom'
# cask 'google-chrome'
# cask 'handbrake'     # video (en/de)coder
# cask 'iterm2'
# cask 'slack'
# cask 'spotify'
# cask 'transmission'  # torrentz?
# cask 'visual-studio-code'
# cask 'vlc'
